soa4-reqs/getAllReq.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="https://localhost:8080/api/v1/space-marines">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getAllSpaceMarinesRequest>
        <gs:sort>id</gs:sort>
        <gs:order>DESC</gs:order>
      </gs:getAllSpaceMarinesRequest>
   </soapenv:Body>
</soapenv:Envelope>

